Importing Pandas Package

In [1]:
import pandas as pd

## Reading JSON data

In [47]:
df=pd.read_json('data.json')

If each JSON added to the file but on whole it's not in JSON structure like this

{"_id": "5e91991ba38b52e0fb47bb7f","index": 0,"guid": "554903ee-525d-47cb-b09d-bf3cc15aec3d"}
{"_id": "5e91991bfc6a941b23db09b0","index": 1,"guid": "9bdd26f6-d14c-4ab8-bcd3-d42b27599fbd"}
{"_id": "5e91991bfc4766a4b3ea78ea","index": 2,"guid": "a3fee0e1-7b15-4f8b-8901-eaef3ea466c8"}

Then to read json file

In [11]:
df=pd.read_json('data_not_in_proper_format.json', lines=True)

## Data Display

To see first 5 rows data then

In [9]:
df.head()

,_id,index,guid,isActive,balance,picture,age,eyeColor,name,gender,company,email,phone,address,about,registered,latitude,longitude,tags,friends,greeting,favoriteFruit
0,5e91936d617c639d56d6e40a,0,7fe17eae-c86f-4b99-896a-018636d54f59,True,"$1,814.13",http://placehold.it/32x32,33,blue,Britney Cote,female,PANZENT,britneycote@panzent.com,+1 (907) 524-3223,"266 Church Lane, Swartzville, Massachusetts, 7719",Dolore aliquip sint ut proident. Ullamco sit e...,2018-07-24T02:51:54 -06:-30,35.545005,-10.315414,"[enim, dolor, fugiat, velit, excepteur, culpa,...",127,"Hello, Britney Cote! You have 5 unread messages.",apple
1,5e91936d0326151699779694,1,b8c92f7e-ca91-4b07-9e49-956ce1f6bebf,False,"$3,610.18",http://placehold.it/32x32,35,NaN,Miranda Mathis,male,HIVEDOM,mirandamathis@hivedom.com,+1 (952) 533-3545,"271 Underhill Avenue, Watchtower, Palau, 7558",Ut ea dolor cupidatat laboris nulla in anim ex...,2014-03-27T08:55:19 -06:-30,16.061777,62.760309,"[occaecat, veniam, elit, consequat, ea, eiusmo...",235,"Hello, Miranda Mathis! You have 3 unread messa...",apple
2,5e91936dac51832738a8d241,2,71627ba1-c0bf-4582-9e16-11a5fa2b7889,False,"$2,358.30",http://placehold.it/32x32,35,blue,Carly Rodgers,female,BUZZNESS,carlyrodgers@buzzness.com,+1 (974) 452-3699,"116 Forbell Street, Kilbourne, American Samoa,...",Culpa tempor voluptate excepteur adipisicing i...,2017-07-26T02:04:48 -06:-30,10.495423,139.383287,"[est, sunt, sunt, laborum, sit, pariatur, nisi]",298,"Hello, Carly Rodgers! You have 6 unread messages.",apple
3,5e91936dc74a890c6f19d933,3,f24ce2af-1e61-47e4-93bb-d8024eb8e581,True,"$2,457.23",http://placehold.it/32x32,24,green,Patsy Mckee,female,VISALIA,patsymckee@visalia.com,+1 (800) 570-2994,"275 Railroad Avenue, Cloverdale, Vermont, 7149",Non duis incididunt laboris tempor aute aliqui...,2015-03-05T07:38:38 -06:-30,89.744027,-120.626924,"[veniam, sit, nulla, duis, elit, sunt, consect...",191,"Hello, Patsy Mckee! You have 5 unread messages.",apple
4,5e91936df9d5b29dec2b1b63,4,013e2904-9e7c-43fe-8bc4-2afc9b8f270c,False,"$2,466.73",http://placehold.it/32x32,20,blue,Waters Farley,male,RODEOLOGY,watersfarley@rodeology.com,+1 (921) 580-2595,"148 Village Road, Dyckesville, Minnesota, 2327",Aute nulla aute proident ullamco in laborum. A...,2017-01-05T01:40:22 -06:-30,-78.364669,63.065719,"[laborum, ipsum, nulla, anim, laborum, minim, ex]",253,"Hello, Waters Farley! You have 6 unread messages.",apple

To see only first row data

In [7]:
df.head(1)

,_id,index,guid,isActive,balance,picture,age,eyeColor,name,gender,...,phone,address,about,registered,latitude,longitude,tags,friends,greeting,favoriteFruit
0,5e91936d617c639d56d6e40a,0,7fe17eae-c86f-4b99-896a-018636d54f59,True,"$1,814.13",http://placehold.it/32x32,33,blue,Britney Cote,female,...,+1 (907) 524-3223,"266 Church Lane, Swartzville, Massachusetts, 7719",Dolore aliquip sint ut proident. Ullamco sit e...,2018-07-24T02:51:54 -06:-30,35.545005,-10.315414,"['enim', 'dolor', 'fugiat', 'velit', 'excepteu...",127,"Hello, Britney Cote! You have 5 unread messages.",apple

To see last 2 rows data then

In [8]:
df.tail(2)

,_id,index,guid,isActive,balance,picture,age,eyeColor,name,gender,...,phone,address,about,registered,latitude,longitude,tags,friends,greeting,favoriteFruit
5,5e91936dbf8fbe6a1b99f888,5,85f0dea3-6239-4081-b847-8bfe7ef88e81,False,"$2,069.59",http://placehold.it/32x32,39,brown,Kelly Monroe,female,...,+1 (807) 505-3666,"171 Gain Court, Bluffview, Maine, 6847",Nisi non incididunt nulla nulla proident molli...,2016-03-20T03:46:58 -06:-30,-25.686888,58.573636,"['exercitation', 'nisi', 'laboris', 'dolor', '...",123,"Hello, Kelly Monroe! You have 7 unread messages.",banana
6,5e91936d4eed9784f3515a46,6,2fb77304-ace9-490c-8e5b-9b62ce3b1602,False,"$1,472.59",http://placehold.it/32x32,24,blue,Chelsea Gregory,female,...,+1 (836) 549-2592,"898 Chester Avenue, Brule, Kentucky, 8909",Laborum labore aliqua aliquip quis elit proide...,2017-05-24T06:34:06 -06:-30,-55.714139,-1.071521,"['labore', 'Lorem', 'consectetur', 'Lorem', 'i...",167,"Hello, Chelsea Gregory! You have 8 unread mess...",apple

If there are so many columns like above some of the columns won't be shown there you will see "..." only. To see all columns below code will come handy

In [3]:
pd.set_option('display.max_columns', None)

In [10]:
df.head()

,_id,index,guid,isActive,balance,picture,age,eyeColor,name,gender,company,email,phone,address,about,registered,latitude,longitude,tags,friends,greeting,favoriteFruit
0,5e91936d617c639d56d6e40a,0,7fe17eae-c86f-4b99-896a-018636d54f59,True,"$1,814.13",http://placehold.it/32x32,33,blue,Britney Cote,female,PANZENT,britneycote@panzent.com,+1 (907) 524-3223,"266 Church Lane, Swartzville, Massachusetts, 7719",Dolore aliquip sint ut proident. Ullamco sit e...,2018-07-24T02:51:54 -06:-30,35.545005,-10.315414,"['enim', 'dolor', 'fugiat', 'velit', 'excepteu...",127,"Hello, Britney Cote! You have 5 unread messages.",apple
1,5e91936d0326151699779694,1,b8c92f7e-ca91-4b07-9e49-956ce1f6bebf,False,"$3,610.18",http://placehold.it/32x32,35,brown,Miranda Mathis,male,HIVEDOM,mirandamathis@hivedom.com,+1 (952) 533-3545,"271 Underhill Avenue, Watchtower, Palau, 7558",Ut ea dolor cupidatat laboris nulla in anim ex...,2014-03-27T08:55:19 -06:-30,16.061777,62.760309,"['occaecat', 'veniam', 'elit', 'consequat', 'e...",235,"Hello, Miranda Mathis! You have 3 unread messa...",apple
2,5e91936dac51832738a8d241,2,71627ba1-c0bf-4582-9e16-11a5fa2b7889,False,"$2,358.30",http://placehold.it/32x32,35,blue,Carly Rodgers,female,BUZZNESS,carlyrodgers@buzzness.com,+1 (974) 452-3699,"116 Forbell Street, Kilbourne, American Samoa,...",Culpa tempor voluptate excepteur adipisicing i...,2017-07-26T02:04:48 -06:-30,10.495423,139.383287,"['est', 'sunt', 'sunt', 'laborum', 'sit', 'par...",298,"Hello, Carly Rodgers! You have 6 unread messages.",apple
3,5e91936dc74a890c6f19d933,3,f24ce2af-1e61-47e4-93bb-d8024eb8e581,True,"$2,457.23",http://placehold.it/32x32,24,green,Patsy Mckee,female,VISALIA,patsymckee@visalia.com,+1 (800) 570-2994,"275 Railroad Avenue, Cloverdale, Vermont, 7149",Non duis incididunt laboris tempor aute aliqui...,2015-03-05T07:38:38 -06:-30,89.744027,-120.626924,"['veniam', 'sit', 'nulla', 'duis', 'elit', 'su...",191,"Hello, Patsy Mckee! You have 5 unread messages.",apple
4,5e91936df9d5b29dec2b1b63,4,013e2904-9e7c-43fe-8bc4-2afc9b8f270c,False,"$2,466.73",http://placehold.it/32x32,20,blue,Waters Farley,male,RODEOLOGY,watersfarley@rodeology.com,+1 (921) 580-2595,"148 Village Road, Dyckesville, Minnesota, 2327",Aute nulla aute proident ullamco in laborum. A...,2017-01-05T01:40:22 -06:-30,-78.364669,63.065719,"['laborum', 'ipsum', 'nulla', 'anim', 'laborum...",253,"Hello, Waters Farley! You have 6 unread messages.",apple

At the time of display just like columns displaying many rows also have restrictions If you want to see all rows then below code is here to save you

In [4]:
pd.set_option('display.max_rows', None)

## Reading data from MySQL

If you need to read data from the MySQL database and load it in the dataframe then

First, you need to create a MySQL connection for that we will provide database configuration details.
I use mysql-connector-python package usually. To create a MySQL connection you need to run above code to run it first you need to install this package for that you need to run below command

pip3 install mysql-connector-python

In [ ]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="root",
  database="test"
)

Once the connection is created you just need to provide query rest will be handled by pandas for you

In [ ]:
df = pd.read_sql("SELECT * FROM table_name", mydb)

## Reading CSV Data

To read data from CSV file

Note: header=0 means you have the names of columns in the first row in the file

## Writing Data to CSV file

In [5]:
df=pd.read_csv('data.csv', sep=';', header=0)

If you want to write the data we have in the data frame to a CSV file then

Note: By default whenever pandas write data from data frame to CSV file they put row index too. To avoid this index=False is required.

In [4]:
df.to_csv('data.csv', sep=';', index=False)

## Understanding the Data

To understand what column types and which have values in every record and which doesn't

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 22 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   _id            19 non-null     object
 1   index          19 non-null     int64
 2   guid           19 non-null     object
 3   isActive       19 non-null     bool
 4   balance        19 non-null     object
 5   picture        19 non-null     object
 6   age            19 non-null     int64
 7   eyeColor       16 non-null     object
 8   name           19 non-null     object
 9   gender         19 non-null     object
 10  company        19 non-null     object
 11  email          19 non-null     object
 12  phone          19 non-null     object
 13  address        19 non-null     object
 14  registered     19 non-null     object
 15  latitude       19 non-null     float64
 16  longitude      19 non-null     float64
 17  tags           19 non-null     object
 18  friends        19 non-null     int64
 19  greeting       19 non-null     object
 20  favoriteFruit  19 non-null     object
 21  about          17 non-null     object
dtypes: bool(1), float64(2), int64(3), object(16)
memory usage: 3.3+ KB

To get columns list

In [5]:
list(df)

['_id',
 'index',
 'guid',
 'isActive',
 'balance',
 'picture',
 'age',
 'eyeColor',
 'name',
 'gender',
 'company',
 'email',
 'phone',
 'address',
 'registered',
 'latitude',
 'longitude',
 'tags',
 'friends',
 'greeting',
 'favoriteFruit',
 'about']

In [6]:
for column in df.columns:
    print(column)

_id
index
guid
isActive
balance
picture
age
eyeColor
name
gender
company
email
phone
address
registered
latitude
longitude
tags
friends
greeting
favoriteFruit
about

To know unique values in a column

In [7]:
df['eyeColor'].unique()

array(['blue', nan, 'green', 'brown'], dtype=object)

In [8]:
len(df.eyeColor.unique())

4

Getting Each value of a column counts like group by

In [9]:
df['eyeColor'].value_counts()

blue     10
brown     3
green     3
Name: eyeColor, dtype: int64

We have 19 rows but if we total above counts then we will get 16 because by default it doesn't count None values. To get None(or NaN) count also you need to add dropna=False

In [10]:
df['eyeColor'].value_counts(dropna=False)

blue     10
brown     3
green     3
NaN       3
Name: eyeColor, dtype: int64

To drop unnecessary columns

In [48]:
df = df.drop(['index','guid','picture','email','phone','latitude','longitude','address','registered','tags'], axis='columns')

In [49]:
df.head()

,_id,isActive,balance,age,eyeColor,name,gender,company,friends,greeting,favoriteFruit,about
0,5e91936d617c639d56d6e40a,True,"$1,814.13",33,blue,Britney Cote,female,PANZENT,127,"Hello, Britney Cote! You have 5 unread messages.",apple,NaN
1,5e91936d0326151699779694,False,"$3,610.18",35,NaN,Miranda Mathis,male,HIVEDOM,235,"Hello, Miranda Mathis! You have 3 unread messa...",apple,Ut ea dolor cupidatat laboris nulla in anim ex...
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,Carly Rodgers,female,BUZZNESS,298,"Hello, Carly Rodgers! You have 6 unread messages.",apple,Culpa tempor voluptate excepteur adipisicing i...
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,Patsy Mckee,female,VISALIA,191,"Hello, Patsy Mckee! You have 5 unread messages.",apple,Non duis incididunt laboris tempor aute aliqui...
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,Waters Farley,male,RODEOLOGY,253,"Hello, Waters Farley! You have 6 unread messages.",apple,Aute nulla aute proident ullamco in laborum. A...

## Data imputation

To change the value of a column based on condition

In [50]:
df.loc[df['_id']=='5e91936d617c639d56d6e40a',['isActive']] = False

In [51]:
df.head()

,_id,isActive,balance,age,eyeColor,name,gender,company,friends,greeting,favoriteFruit,about
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,Britney Cote,female,PANZENT,127,"Hello, Britney Cote! You have 5 unread messages.",apple,NaN
1,5e91936d0326151699779694,False,"$3,610.18",35,NaN,Miranda Mathis,male,HIVEDOM,235,"Hello, Miranda Mathis! You have 3 unread messa...",apple,Ut ea dolor cupidatat laboris nulla in anim ex...
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,Carly Rodgers,female,BUZZNESS,298,"Hello, Carly Rodgers! You have 6 unread messages.",apple,Culpa tempor voluptate excepteur adipisicing i...
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,Patsy Mckee,female,VISALIA,191,"Hello, Patsy Mckee! You have 5 unread messages.",apple,Non duis incididunt laboris tempor aute aliqui...
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,Waters Farley,male,RODEOLOGY,253,"Hello, Waters Farley! You have 6 unread messages.",apple,Aute nulla aute proident ullamco in laborum. A...

Sometimes we get None values there we usually fill with data which is kind of normal. For example, most of the people have brown coloured eyes and some records have None in the eyeColor column. To fill it

In [52]:
df['eyeColor'].fillna('brown', inplace=True)

In [53]:
df.head()

,_id,isActive,balance,age,eyeColor,name,gender,company,friends,greeting,favoriteFruit,about
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,Britney Cote,female,PANZENT,127,"Hello, Britney Cote! You have 5 unread messages.",apple,NaN
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,Miranda Mathis,male,HIVEDOM,235,"Hello, Miranda Mathis! You have 3 unread messa...",apple,Ut ea dolor cupidatat laboris nulla in anim ex...
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,Carly Rodgers,female,BUZZNESS,298,"Hello, Carly Rodgers! You have 6 unread messages.",apple,Culpa tempor voluptate excepteur adipisicing i...
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,Patsy Mckee,female,VISALIA,191,"Hello, Patsy Mckee! You have 5 unread messages.",apple,Non duis incididunt laboris tempor aute aliqui...
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,Waters Farley,male,RODEOLOGY,253,"Hello, Waters Farley! You have 6 unread messages.",apple,Aute nulla aute proident ullamco in laborum. A...

We can do several operations specific to data types. For example, If you want to convert values to uppercase of a column which has string values then pretty simple. Code for this is

In [54]:
df["gender"] = df["gender"].str.upper()

In [55]:
df.head()

,_id,isActive,balance,age,eyeColor,name,gender,company,friends,greeting,favoriteFruit,about
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,Britney Cote,FEMALE,PANZENT,127,"Hello, Britney Cote! You have 5 unread messages.",apple,NaN
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,Miranda Mathis,MALE,HIVEDOM,235,"Hello, Miranda Mathis! You have 3 unread messa...",apple,Ut ea dolor cupidatat laboris nulla in anim ex...
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,Carly Rodgers,FEMALE,BUZZNESS,298,"Hello, Carly Rodgers! You have 6 unread messages.",apple,Culpa tempor voluptate excepteur adipisicing i...
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,Patsy Mckee,FEMALE,VISALIA,191,"Hello, Patsy Mckee! You have 5 unread messages.",apple,Non duis incididunt laboris tempor aute aliqui...
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,Waters Farley,MALE,RODEOLOGY,253,"Hello, Waters Farley! You have 6 unread messages.",apple,Aute nulla aute proident ullamco in laborum. A...

We can consider a data frame as a matrix so we can do matrix operations too. For example, let's say we want to create a new column where we want to calculate friends count with age. To do this

In [56]:
df['friends_to_age']=df['friends']/df['age']

In [57]:
df.head()

,_id,isActive,balance,age,eyeColor,name,gender,company,friends,greeting,favoriteFruit,about,friends_to_age
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,Britney Cote,FEMALE,PANZENT,127,"Hello, Britney Cote! You have 5 unread messages.",apple,NaN,3.848485
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,Miranda Mathis,MALE,HIVEDOM,235,"Hello, Miranda Mathis! You have 3 unread messa...",apple,Ut ea dolor cupidatat laboris nulla in anim ex...,6.714286
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,Carly Rodgers,FEMALE,BUZZNESS,298,"Hello, Carly Rodgers! You have 6 unread messages.",apple,Culpa tempor voluptate excepteur adipisicing i...,8.514286
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,Patsy Mckee,FEMALE,VISALIA,191,"Hello, Patsy Mckee! You have 5 unread messages.",apple,Non duis incididunt laboris tempor aute aliqui...,7.958333
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,Waters Farley,MALE,RODEOLOGY,253,"Hello, Waters Farley! You have 6 unread messages.",apple,Aute nulla aute proident ullamco in laborum. A...,12.650000

You can do all sorts of things on values and write lambda functions too to extract data from values present in a column. For example, If you read the greeting message it contains the number of unread messages count. I don't think greeting message has any significance except the unread messages count so we can extract and put it in a new column with name unread_messages_count

In [58]:
import re
df["unread_messages_count"] = df["greeting"].apply(lambda greeting: re.findall(r'\d+', greeting)[0])

In [59]:
df.head()

,_id,isActive,balance,age,eyeColor,name,gender,company,friends,greeting,favoriteFruit,about,friends_to_age,unread_messages_count
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,Britney Cote,FEMALE,PANZENT,127,"Hello, Britney Cote! You have 5 unread messages.",apple,NaN,3.848485,5
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,Miranda Mathis,MALE,HIVEDOM,235,"Hello, Miranda Mathis! You have 3 unread messa...",apple,Ut ea dolor cupidatat laboris nulla in anim ex...,6.714286,3
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,Carly Rodgers,FEMALE,BUZZNESS,298,"Hello, Carly Rodgers! You have 6 unread messages.",apple,Culpa tempor voluptate excepteur adipisicing i...,8.514286,6
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,Patsy Mckee,FEMALE,VISALIA,191,"Hello, Patsy Mckee! You have 5 unread messages.",apple,Non duis incididunt laboris tempor aute aliqui...,7.958333,5
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,Waters Farley,MALE,RODEOLOGY,253,"Hello, Waters Farley! You have 6 unread messages.",apple,Aute nulla aute proident ullamco in laborum. A...,12.650000,6

Let's say you want to extract what you want from a column value and put it in different columns that also possible. For example, Let's split name into first name and last name

In [60]:
def extract_first_last_name(row):
    name = row['name'].split()
    row['first_name'] = name[0]
    row['last_name'] = name[1]
    return row

In [61]:
df = df.apply(lambda row: extract_first_last_name(row), axis='columns')

In [62]:
df.head()

,_id,isActive,balance,age,eyeColor,name,gender,company,friends,greeting,favoriteFruit,about,friends_to_age,unread_messages_count,first_name,last_name
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,Britney Cote,FEMALE,PANZENT,127,"Hello, Britney Cote! You have 5 unread messages.",apple,NaN,3.848485,5,Britney,Cote
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,Miranda Mathis,MALE,HIVEDOM,235,"Hello, Miranda Mathis! You have 3 unread messa...",apple,Ut ea dolor cupidatat laboris nulla in anim ex...,6.714286,3,Miranda,Mathis
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,Carly Rodgers,FEMALE,BUZZNESS,298,"Hello, Carly Rodgers! You have 6 unread messages.",apple,Culpa tempor voluptate excepteur adipisicing i...,8.514286,6,Carly,Rodgers
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,Patsy Mckee,FEMALE,VISALIA,191,"Hello, Patsy Mckee! You have 5 unread messages.",apple,Non duis incididunt laboris tempor aute aliqui...,7.958333,5,Patsy,Mckee
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,Waters Farley,MALE,RODEOLOGY,253,"Hello, Waters Farley! You have 6 unread messages.",apple,Aute nulla aute proident ullamco in laborum. A...,12.650000,6,Waters,Farley

Dropping columns which doesn't have proper data

We did whatever data imputation we need to do and for some columns we can't do anything and there is no point of them to keep because its going to give anyway trouble at the time of model training so we want to drop those columns and it's data then

In [63]:
df = df.dropna(axis='columns')

In [64]:
df.head()

,_id,isActive,balance,age,eyeColor,name,gender,company,friends,greeting,favoriteFruit,friends_to_age,unread_messages_count,first_name,last_name
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,Britney Cote,FEMALE,PANZENT,127,"Hello, Britney Cote! You have 5 unread messages.",apple,3.848485,5,Britney,Cote
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,Miranda Mathis,MALE,HIVEDOM,235,"Hello, Miranda Mathis! You have 3 unread messa...",apple,6.714286,3,Miranda,Mathis
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,Carly Rodgers,FEMALE,BUZZNESS,298,"Hello, Carly Rodgers! You have 6 unread messages.",apple,8.514286,6,Carly,Rodgers
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,Patsy Mckee,FEMALE,VISALIA,191,"Hello, Patsy Mckee! You have 5 unread messages.",apple,7.958333,5,Patsy,Mckee
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,Waters Farley,MALE,RODEOLOGY,253,"Hello, Waters Farley! You have 6 unread messages.",apple,12.650000,6,Waters,Farley

In [65]:
df = df.drop(['name','greeting'], axis='columns')

Dropping duplicate rows

In [66]:
unique_df = df.drop_duplicates()

In [67]:
unique_df.head(10)

,_id,isActive,balance,age,eyeColor,gender,company,friends,favoriteFruit,friends_to_age,unread_messages_count,first_name,last_name
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,FEMALE,PANZENT,127,apple,3.848485,5,Britney,Cote
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,MALE,HIVEDOM,235,apple,6.714286,3,Miranda,Mathis
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,FEMALE,BUZZNESS,298,apple,8.514286,6,Carly,Rodgers
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,FEMALE,VISALIA,191,apple,7.958333,5,Patsy,Mckee
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,MALE,RODEOLOGY,253,apple,12.650000,6,Waters,Farley
5,5e91936dbf8fbe6a1b99f888,False,"$2,069.59",39,brown,FEMALE,QUAILCOM,123,banana,3.153846,7,Kelly,Monroe
6,5e91936d4eed9784f3515a46,False,"$1,472.59",24,blue,FEMALE,ENTROPIX,167,apple,6.958333,8,Chelsea,Gregory

In [68]:
unique_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   _id                    7 non-null      object
 1   isActive               7 non-null      bool
 2   balance                7 non-null      object
 3   age                    7 non-null      int64
 4   eyeColor               7 non-null      object
 5   gender                 7 non-null      object
 6   company                7 non-null      object
 7   friends                7 non-null      int64
 8   favoriteFruit          7 non-null      object
 9   friends_to_age         7 non-null      float64
 10  unread_messages_count  7 non-null      object
 11  first_name             7 non-null      object
 12  last_name              7 non-null      object
dtypes: bool(1), float64(1), int64(2), object(9)
memory usage: 735.0+ bytes

### Renaming column names

In [69]:
unique_df = unique_df.rename(columns={"unread_messages_count": "unread_count","friends_to_age":"friends_by_age"})

In [70]:
unique_df.head()

,_id,isActive,balance,age,eyeColor,gender,company,friends,favoriteFruit,friends_by_age,unread_count,first_name,last_name
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,FEMALE,PANZENT,127,apple,3.848485,5,Britney,Cote
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,MALE,HIVEDOM,235,apple,6.714286,3,Miranda,Mathis
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,FEMALE,BUZZNESS,298,apple,8.514286,6,Carly,Rodgers
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,FEMALE,VISALIA,191,apple,7.958333,5,Patsy,Mckee
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,MALE,RODEOLOGY,253,apple,12.650000,6,Waters,Farley

## Data Filtering and sorting

In [71]:
unique_df.loc[unique_df['age'] > 30]

,_id,isActive,balance,age,eyeColor,gender,company,friends,favoriteFruit,friends_by_age,unread_count,first_name,last_name
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,FEMALE,PANZENT,127,apple,3.848485,5,Britney,Cote
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,MALE,HIVEDOM,235,apple,6.714286,3,Miranda,Mathis
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,FEMALE,BUZZNESS,298,apple,8.514286,6,Carly,Rodgers
5,5e91936dbf8fbe6a1b99f888,False,"$2,069.59",39,brown,FEMALE,QUAILCOM,123,banana,3.153846,7,Kelly,Monroe

In [72]:
unique_df.loc[unique_df['eyeColor'].isin(['brown','green'])]

,_id,isActive,balance,age,eyeColor,gender,company,friends,favoriteFruit,friends_by_age,unread_count,first_name,last_name
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,MALE,HIVEDOM,235,apple,6.714286,3,Miranda,Mathis
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,FEMALE,VISALIA,191,apple,7.958333,5,Patsy,Mckee
5,5e91936dbf8fbe6a1b99f888,False,"$2,069.59",39,brown,FEMALE,QUAILCOM,123,banana,3.153846,7,Kelly,Monroe

In [73]:
unique_df.loc[unique_df['eyeColor'].str.contains('b')]

,_id,isActive,balance,age,eyeColor,gender,company,friends,favoriteFruit,friends_by_age,unread_count,first_name,last_name
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,FEMALE,PANZENT,127,apple,3.848485,5,Britney,Cote
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,MALE,HIVEDOM,235,apple,6.714286,3,Miranda,Mathis
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,FEMALE,BUZZNESS,298,apple,8.514286,6,Carly,Rodgers
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,MALE,RODEOLOGY,253,apple,12.650000,6,Waters,Farley
5,5e91936dbf8fbe6a1b99f888,False,"$2,069.59",39,brown,FEMALE,QUAILCOM,123,banana,3.153846,7,Kelly,Monroe
6,5e91936d4eed9784f3515a46,False,"$1,472.59",24,blue,FEMALE,ENTROPIX,167,apple,6.958333,8,Chelsea,Gregory

In [74]:
unique_df.sort_values(by=['first_name'])

,_id,isActive,balance,age,eyeColor,gender,company,friends,favoriteFruit,friends_by_age,unread_count,first_name,last_name
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,FEMALE,PANZENT,127,apple,3.848485,5,Britney,Cote
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,FEMALE,BUZZNESS,298,apple,8.514286,6,Carly,Rodgers
6,5e91936d4eed9784f3515a46,False,"$1,472.59",24,blue,FEMALE,ENTROPIX,167,apple,6.958333,8,Chelsea,Gregory
5,5e91936dbf8fbe6a1b99f888,False,"$2,069.59",39,brown,FEMALE,QUAILCOM,123,banana,3.153846,7,Kelly,Monroe
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,MALE,HIVEDOM,235,apple,6.714286,3,Miranda,Mathis
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,FEMALE,VISALIA,191,apple,7.958333,5,Patsy,Mckee
4,5e91936df9d5b29dec2b1b63,False,"$2,466.73",20,blue,MALE,RODEOLOGY,253,apple,12.650000,6,Waters,Farley

## Creating unique data set with specific fields

In [75]:
df.groupby('_id').agg({'age':'min', 'balance':'min'})

                          age    balance
_id
5e91936d0326151699779694   35  $3,610.18
5e91936d4eed9784f3515a46   24  $1,472.59
5e91936d617c639d56d6e40a   33  $1,814.13
5e91936dac51832738a8d241   35  $2,358.30
5e91936dbf8fbe6a1b99f888   39  $2,069.59
5e91936dc74a890c6f19d933   24  $2,457.23
5e91936df9d5b29dec2b1b63   20  $2,466.73

In [76]:
df.groupby('_id').agg({'age':'min', 'balance':'min'}).reset_index()

                        _id  age    balance
0  5e91936d0326151699779694   35  $3,610.18
1  5e91936d4eed9784f3515a46   24  $1,472.59
2  5e91936d617c639d56d6e40a   33  $1,814.13
3  5e91936dac51832738a8d241   35  $2,358.30
4  5e91936dbf8fbe6a1b99f888   39  $2,069.59
5  5e91936dc74a890c6f19d933   24  $2,457.23
6  5e91936df9d5b29dec2b1b63   20  $2,466.73

## Merging 2 dataframes

In [77]:
food_dict = [{"_id":"5e91936d0326151699779694", "favouriteFood":"Pasta"},
{"_id":"5e91936d4eed9784f3515a46", "favouriteFood":"Hamburgers"},
{"_id":"5e91936d617c639d56d6e40a", "favouriteFood":"Pizza"},
{"_id":"5e91936dac51832738a8d241", "favouriteFood":"Vegetables"},
{"_id":"5e91936dbf8fbe6a1b99f888", "favouriteFood":"Chicken"},
{"_id":"5e91936dc74a890c6f19d933", "favouriteFood":"Pasta"}
]

In [78]:
df_food = pd.DataFrame(food_dict)

In [79]:
df_food.head()

                        _id favouriteFood
0  5e91936d0326151699779694         Pasta
1  5e91936d4eed9784f3515a46    Hamburgers
2  5e91936d617c639d56d6e40a         Pizza
3  5e91936dac51832738a8d241    Vegetables
4  5e91936dbf8fbe6a1b99f888       Chicken

In [80]:
unique_df = unique_df.merge(df_food, on="_id", how = 'inner')

In [81]:
unique_df.head(10)

,_id,isActive,balance,age,eyeColor,gender,company,friends,favoriteFruit,friends_by_age,unread_count,first_name,last_name,favouriteFood
0,5e91936d617c639d56d6e40a,False,"$1,814.13",33,blue,FEMALE,PANZENT,127,apple,3.848485,5,Britney,Cote,Pizza
1,5e91936d0326151699779694,False,"$3,610.18",35,brown,MALE,HIVEDOM,235,apple,6.714286,3,Miranda,Mathis,Pasta
2,5e91936dac51832738a8d241,False,"$2,358.30",35,blue,FEMALE,BUZZNESS,298,apple,8.514286,6,Carly,Rodgers,Vegetables
3,5e91936dc74a890c6f19d933,True,"$2,457.23",24,green,FEMALE,VISALIA,191,apple,7.958333,5,Patsy,Mckee,Pasta
4,5e91936dbf8fbe6a1b99f888,False,"$2,069.59",39,brown,FEMALE,QUAILCOM,123,banana,3.153846,7,Kelly,Monroe,Chicken
5,5e91936d4eed9784f3515a46,False,"$1,472.59",24,blue,FEMALE,ENTROPIX,167,apple,6.958333,8,Chelsea,Gregory,Hamburgers